# St7GetBeamStyle

Returns the display style for beams.

long St7GetBeamStyle(long uID, long* Style)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

Style

One of bsLine, bsSection, bsSolid or bsSlice.